src/Catalogs/ШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныСообщений</Name>
			<Comment>Шаблоны сообщений</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеМессенджерHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеМессенджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеPush</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецШаблона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецШаблонаСообщения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьВТранслите</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяТипаПараметраВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляВводаНаОсновании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенДляЭлектронныхПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаSMS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблонаПисьмаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекстаПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДляАвтора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранслитерироватьИменаФайлов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УпаковатьВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматВложений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПоВнешнейОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьИПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПериодВыполнения</Name>
					<Comment>Значение, указываемое в днях</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSВремяНачалаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSВремяОкончанияОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормыИВложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныСообщений/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - Обработка заполнения
//
// Параметры:
//  ДанныеЗаполнения	 - 	 - 
//  ТекстЗаполнения		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда 
		ДатаСоздания 	= ТекущаяДатаСеанса();
		Автор 			= ПараметрыСеанса.ТекущийСотрудник;
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработка проверки заполнения
//
// Параметры:
//  Отказ				 - 	 - 
//  ПроверяемыеРеквизиты - 	 - 
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбменДанными.Загрузка = Истина Тогда 
		ПроверяемыеРеквизиты.Добавить("SMSВремяНачалаОтправки"); 
		ПроверяемыеРеквизиты.Добавить("SMSВремяОкончанияОтправки"); 
	КонецЕсли;
	
	ПроверитьКорректностьУказанныхПараметров(Отказ);
	
КонецПроцедуры

// Процедура - Перед записью
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		Если НЕ ЗначениеЗаполнено(Автор) Тогда 
			Автор = ПараметрыСеанса.ТекущийСотрудник;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьСодержаниеШаблонаМессенджер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - Проверить корректность указанных параметров
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПроверитьКорректностьУказанныхПараметров(Отказ, Сообщать = Истина, ОчищатьНеКорректныеПараметры = Ложь)

	Если Справочники.ШаблоныСообщений.ШаблонИспользуетсяВТриггерныхСобытиях(Ссылка) Тогда 
		ТаблицаВсехПараметров 			= ОбщегоНазначенияПовтИсп.ПолучитьТаблицуПараметровВсехПодставляемыхРеквизитов();
		Содержание_Проверочное 			= Содержание;
		ПарсерHTML 						= Новый ЧтениеHTML;
		ПарсерHTML.УстановитьСтроку(ТекстHTML);
		ПостроительDOM 					= Новый ПостроительDOM;
		ДокументHTML 					= ПостроительDOM.Прочитать(ПарсерHTML);
		Если ДокументHTML.Тело = Неопределено Тогда 
			ТекстHTML_Проверочное 		= "";
		Иначе 	
			ТекстHTML_Проверочное 		= ДокументHTML.Тело.ТекстовоеСодержимое;
		КонецЕсли;	
		ЗадачаОписание_Проверочное 		= ЗадачаОписание;
		
		Для Каждого СтрокаТаблицы Из ТаблицаВсехПараметров Цикл
			Содержание_Проверочное 		= СтрЗаменить(Содержание_Проверочное	, СтрокаТаблицы.НаименованиеПараметра, ""); 
			ТекстHTML_Проверочное 		= СтрЗаменить(ТекстHTML_Проверочное		, СтрокаТаблицы.НаименованиеПараметра, ""); 
			ЗадачаОписание_Проверочное 	= СтрЗаменить(ЗадачаОписание_Проверочное, СтрокаТаблицы.НаименованиеПараметра, ""); 
		КонецЦикла;	
		
		Если ЗначениеЗаполнено(СокрЛП(Содержание_Проверочное)) Тогда 
			МассивНеКорректныхПараметров = Справочники.ШаблоныСообщений.ВернутьМассивНекорректныхПараметров(Содержание_Проверочное);
			Если МассивНеКорректныхПараметров.Количество() <> 0 Тогда 
				Отказ = Истина;
				СообщениеоНекорректныхПараметрах = НСтр("ru='В содержании сообщения указан некорректный параметр(ы) или символ(ы):';en='The message contains an invalid parameter or characters:'") + Символы.ПС + СтрСоединить(МассивНеКорректныхПараметров, Символы.ПС);
				Если Сообщать Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеоНекорректныхПараметрах, ЭтотОбъект, "Содержание");
				КонецЕсли;
				Если ОчищатьНеКорректныеПараметры Тогда 
					
				Иначе 	
					Возврат;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СокрЛП(ТекстHTML_Проверочное)) Тогда 
			МассивНеКорректныхПараметров = Справочники.ШаблоныСообщений.ВернутьМассивНекорректныхПараметров(ТекстHTML_Проверочное);
			Если МассивНеКорректныхПараметров.Количество() <> 0 Тогда 
				Отказ = Истина;
				СообщениеоНекорректныхПараметрах = НСтр("ru='В содержании электронного письма указан некорректный параметр(ы) или символ(ы):';en='The email contains an invalid parameter or characters:'") + Символы.ПС + СтрСоединить(МассивНеКорректныхПараметров, Символы.ПС);
				Если Сообщать Тогда 				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеоНекорректныхПараметрах, ЭтотОбъект, "ТекстHTML");
				КонецЕсли;
				Если ОчищатьНеКорректныеПараметры Тогда 
					
				Иначе 					
					Возврат;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СокрЛП(ЗадачаОписание_Проверочное)) Тогда 
			МассивНеКорректныхПараметров = Справочники.ШаблоныСообщений.ВернутьМассивНекорректныхПараметров(ЗадачаОписание_Проверочное);
			Если МассивНеКорректныхПараметров.Количество() <> 0 Тогда 
				Отказ = Истина;
				СообщениеоНекорректныхПараметрах = НСтр("ru='В содержании описания задачи указан некорректный параметр(ы) или символ(ы):';en='The problem description contains an invalid parameter or characters:'") + Символы.ПС + СтрСоединить(МассивНеКорректныхПараметров, Символы.ПС);
				Если Сообщать Тогда 				
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеоНекорректныхПараметрах, ЭтотОбъект, "ЗадачаОписание");
				КонецЕсли;
				Если ОчищатьНеКорректныеПараметры Тогда 
					
				Иначе 					
					Возврат;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обновляет содержание шаблона сообщения в мессенджер.
//
Процедура ОбновитьСодержаниеШаблонаМессенджер()
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СодержаниеМессенджерHTML) Тогда
		СодержаниеМессенджер = "";
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(ДополнительныеСвойства, "ОбновитьСодержаниеМессенджер", Ложь)
		И ОбщегоНазначения.ПолучитьЗначениеРеквизита(Ссылка, "СодержаниеМессенджерHTML") = СодержаниеМессенджерHTML Тогда
		
		// Параметр принудительного обновления не передан, содержание не изменилось - ничего не делаем.
		Возврат;
	КонецЕсли;
	
	СодержаниеМессенджер = Справочники.ШаблоныСообщений.ПолучитьТекстИзHTMLКода(СодержаниеМессенджерHTML);
	
КонецПроцедуры

#КонецОбласти
